app/controllers/application_controller.rb

  def index
    @questions = Question.all
---
SELECT  "questions".* FROM "questions" ORDER BY "questions"."id" ASC LIMIT ?  [["LIMIT", 1]]