app/controllers/question_controller.rb

  def new
    head :ok, content_type: 'text/html'
    @question = Question.new(question_params)
    start = Time.now
    @answer = Answer.new(value: @question.send(leveler(params[:level]).to_s, task_id: @question.id)
    puts "#{(Time.now - start) * 1000}ms"
    thr = Thread.new do
      do_post(@answer)
      Question.create(question_params)
      Answer.create(answer_params)
      thr.kill
    end
  end

  def question_params
    params.permit(:question, :id, :level)
  end

  def answer_params
    {
      question_id: @question.id,
      value: @answer.value,
      task_id: @answer.task_id
    }
  end
---
INSERT INTO "answers" ("question_id", "value", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["question_id", 4], ["value", "«Дар напрасный, дар случайный...»"], ["task_id", 123], ["created_at", 2016-12-25 11:57:54 UTC], ["updated_at", 2016-12-25 11:57:54 UTC]]
INSERT INTO "questions" ("task_id", "level", "value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["task_id", 2334], ["level", "level1"], ["value", "Ты сокровенное мечтанье, —"], ["created_at", 2016-12-23 19:27:05 UTC], ["updated_at", 2016-12-23 19:27:05 UTC]]
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = ? LIMIT ?  [["question_id", 3], ["LIMIT", 1]]
SELECT  "questions".* FROM "questions" WHERE "questions"."task_id" = ? LIMIT ?  [["task_id", 888881], ["LIMIT", 1]]