app/views/application/index.html.slim

     = "Task ID:#{question.task_id}"
     = "Question:#{question.value}"
     = "Answer:#{question.answer.value}"
---
SELECT  "questions".* FROM "questions" ORDER BY "questions"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = ? LIMIT ?  [["question_id", 1], ["LIMIT", 1]]